docs/documentation.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-01-30 Mon 18:53 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="Davide Badalotti" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orga6e0084">1. Documentation</a>
<ul>
<li><a href="#org466bcfa">1.1. MetricMeasureSpace.jl</a></li>
<li><a href="#orge82ac8e">1.2. RepeatUntilConvergence</a>
<ul>
<li><a href="#orgd605093">1.2.1. abstract type BaseRepeatUntilConvergence{T}</a></li>
<li><a href="#org9629849">1.2.2. mutable struct RepeatUntilConvergence{T}</a></li>
<li><a href="#org9b88b9c">1.2.3. mutable struct LargeMamoryRepeatUntilConvergence{T}</a></li>
<li><a href="#org02979e6">1.2.4. mutable struct SingleValueRepeatUntilConvergence{T}</a></li>
<li><a href="#org9722c35">1.2.5. Function update<sub>history</sub>!</a></li>
<li><a href="#org36c815c">1.2.6. Function has<sub>converged</sub><sub>wrapper</sub></a></li>
<li><a href="#orgce00407">1.2.7. Function execute!</a></li>
</ul>
</li>
<li><a href="#orgfa0c19d">1.3. SinkhornKnopp.jl</a>
<ul>
<li><a href="#orgaa80273">1.3.1. struct data<sub>SK</sub></a></li>
<li><a href="#orgfeec790">1.3.2. Function update<sub>SK</sub></a></li>
<li><a href="#org7a8c3ec">1.3.3. Function compute<sub>marginals</sub></a></li>
<li><a href="#org7035792">1.3.4. Function stop<sub>SK</sub><sub>T</sub></a></li>
<li><a href="#org5ee4c49">1.3.5. Function stop<sub>SK</sub><sub>ab</sub><sub>old</sub></a></li>
<li><a href="#org67a75a3">1.3.6. Function stop<sub>SK</sub><sub>ab</sub><sub>new</sub></a></li>
<li><a href="#org4d01084">1.3.7. Function stop<sub>SK</sub></a></li>
</ul>
</li>
<li><a href="#org6869cda">1.4. loss.jl</a>
<ul>
<li><a href="#org5734442">1.4.1. struct loss</a></li>
<li><a href="#orgfccaf41">1.4.2. Function GW<sub>cost</sub></a></li>
</ul>
</li>
<li><a href="#orgba29220">1.5. Barycenters.jl</a>
<ul>
<li><a href="#org508b8da">1.5.1. Function update<sub>transport</sub></a></li>
<li><a href="#org935bc3b">1.5.2. Function stop<sub>tranport</sub></a></li>
<li><a href="#orgd5ae4f7">1.5.3. Function compute<sub>C</sub></a></li>
<li><a href="#org62320e4">1.5.4. Function init<sub>Ts</sub></a></li>
<li><a href="#org22c1f36">1.5.5. Function update<sub>barycenters</sub></a></li>
<li><a href="#orgdea3eb3">1.5.6. Function stop<sub>barycenters</sub><sub>niter</sub></a></li>
<li><a href="#org61e823c">1.5.7. Function init<sub>C</sub></a></li>
<li><a href="#orgcce97b8">1.5.8. Function GW<sub>barycenters</sub> (the main function)</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orga6e0084" class="outline-2">
<h2 id="orga6e0084"><span class="section-number-2">1.</span> Documentation</h2>
<div class="outline-text-2" id="text-1">
<p>
In this document, we describe the algorithms that we implemented to compute the Gromov-Wasserstein barycenters we talk about in theory.org.
</p>
</div>


<div id="outline-container-org466bcfa" class="outline-3">
<h3 id="org466bcfa"><span class="section-number-3">1.1.</span> MetricMeasureSpace.jl</h3>
<div class="outline-text-3" id="text-1-1">
<p>
In this file we implement the struct we talk about in implementation.org.
</p>
</div>
</div>


<div id="outline-container-orge82ac8e" class="outline-3">
<h3 id="orge82ac8e"><span class="section-number-3">1.2.</span> RepeatUntilConvergence</h3>
<div class="outline-text-3" id="text-1-2">
<p>
In this file, we defined a structure that can repeat a function until convergence. It will be more clear in the following.
</p>
</div>

<div id="outline-container-orgd605093" class="outline-4">
<h4 id="orgd605093"><span class="section-number-4">1.2.1.</span> abstract type BaseRepeatUntilConvergence{T}</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
It is a parametric abstract type that has, as subtypes, the concrete parametric types 
</p>
<ul class="org-ul">
<li>RepeatUntilConvergence</li>
<li>LargeMemoryRepeatUntilConvergence</li>
<li>SingleValueRepeatUntilConvergence</li>
</ul>
</div>
</div>

<div id="outline-container-org9629849" class="outline-4">
<h4 id="org9629849"><span class="section-number-4">1.2.2.</span> mutable struct RepeatUntilConvergence{T}</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
It is a parametric struct defined in the following way: 
</p>

<div class="org-src-container">
<pre class="src src-julia"><span style="color: #5EC4FF;">mutable struct</span> <span style="color: #EBBF83;">RepeatUntilConvergence</span><span style="color: #5EC4FF;">{</span>T<span style="color: #5EC4FF;">}</span> &lt;: <span style="color: #EBBF83;">BaseRepeatUntilConvergence</span><span style="color: #5EC4FF;">{</span>T<span style="color: #5EC4FF;">}</span>
    update_func::<span style="color: #EBBF83;">Function</span>
    has_converged::<span style="color: #EBBF83;">Function</span>
    history::<span style="color: #EBBF83;">CircularBuffer</span><span style="color: #5EC4FF;">{</span>T<span style="color: #5EC4FF;">}</span>
    init_vals::<span style="color: #EBBF83;">T</span> 
<span style="color: #5EC4FF;">end</span>
</pre>
</div>
</div>

<ol class="org-ol">
<li><a id="org2c51695"></a>T<br />
<div class="outline-text-5" id="text-1-2-2-1">
<p>
T is the type on which a type RepeatUntilConvergence depends on: the idea is that we have an update function that takes some input of type T and 
returns something of type T, so that we can iterate this function.
</p>
</div>
</li>

<li><a id="org40f7a67"></a>update<sub>func</sub><br />
<div class="outline-text-5" id="text-1-2-2-2">
<p>
The update function is the function that we need to iterate on something of type T.
</p>
</div>
</li>

<li><a id="orgd334f11"></a>has<sub>converged</sub><br />
<div class="outline-text-5" id="text-1-2-2-3">
<p>
This function is a criterion for convergence that returns a Bool type. It checks if we have to stop the execution, possibly using the history 
field.
</p>
</div>
</li>

<li><a id="org0a1ffba"></a>history<br />
<div class="outline-text-5" id="text-1-2-2-4">
<p>
The history contains the output that we need to store to check the stop criterion. It has been organized in a CircularBuffer{T} type because, as
we said above, all the outputs of the update function are of type T and here we can store only that elements, and we didn't choose a Vector{T}
because maybe is not necessary to store all the outputs: for example the stop criterion could involve just the last two output, so that we need 
to have a CircularBuffer{T} of length 2.
</p>
</div>
</li>

<li><a id="org3f7a111"></a>init<sub>vals</sub><br />
<div class="outline-text-5" id="text-1-2-2-5">
<p>
It is the initial value of the iterative process, so it is the first value that is updated, which means that it must be of type T.
</p>
</div>
</li>

<li><a id="org51d38d9"></a>inner constructor<br />
<div class="outline-text-5" id="text-1-2-2-6">
<p>
Arguments: an update function, an has<sub>converged</sub> function and a Int memory<sub>size</sub>.
It returns an element of type RepeatUntilConvergence{T} initializing the memory size of the CircularBuffer{T} according to memory<sub>size</sub>. 
Before doing that, it checks that the update function has a method for type T and returns a type T, and it check that the has<sub>converged</sub> function
has a method for type Vector{T} and returns a Bool type, otherwise it raises an error. 
Achtung: it doesn't initialize init<sub>vals</sub>. 
</p>
</div>
</li>
</ol>
</div>

<div id="outline-container-org9b88b9c" class="outline-4">
<h4 id="org9b88b9c"><span class="section-number-4">1.2.3.</span> mutable struct LargeMamoryRepeatUntilConvergence{T}</h4>
<div class="outline-text-4" id="text-1-2-3">
<p>
It is a parametric struct defined in the following way: 
</p>

<div class="org-src-container">
<pre class="src src-julia"><span style="color: #5EC4FF;">mutable struct</span> <span style="color: #EBBF83;">RepeatUntilConvergence</span><span style="color: #5EC4FF;">{</span>T<span style="color: #5EC4FF;">}</span> &lt;: <span style="color: #EBBF83;">BaseRepeatUntilConvergence</span><span style="color: #5EC4FF;">{</span>T<span style="color: #5EC4FF;">}</span>
    update_func::<span style="color: #EBBF83;">Function</span>
    has_converged::<span style="color: #EBBF83;">Function</span>
    history::<span style="color: #EBBF83;">Vector</span><span style="color: #5EC4FF;">{</span>T<span style="color: #5EC4FF;">}</span>
    init_vals::<span style="color: #EBBF83;">T</span> 
<span style="color: #5EC4FF;">end</span>
</pre>
</div>

<p>
It is exactly as the other, except that the history is a Vector{T}. It could be used when we need to use all the outputs the execution produced.
We didn't implemented it, because we never use it.
</p>
</div>
</div>

<div id="outline-container-org02979e6" class="outline-4">
<h4 id="org02979e6"><span class="section-number-4">1.2.4.</span> mutable struct SingleValueRepeatUntilConvergence{T}</h4>
<div class="outline-text-4" id="text-1-2-4">
<p>
It is a parametric struct defined in the following way: 
</p>

<div class="org-src-container">
<pre class="src src-julia"><span style="color: #5EC4FF;">mutable struct</span> <span style="color: #EBBF83;">RepeatUntilConvergence</span><span style="color: #5EC4FF;">{</span>T<span style="color: #5EC4FF;">}</span> &lt;: <span style="color: #EBBF83;">BaseRepeatUntilConvergence</span><span style="color: #5EC4FF;">{</span>T<span style="color: #5EC4FF;">}</span>
    update_func::<span style="color: #EBBF83;">Function</span>
    has_converged::<span style="color: #EBBF83;">Function</span>
    history::<span style="color: #EBBF83;">T</span>
    init_vals::<span style="color: #EBBF83;">T</span> 
<span style="color: #5EC4FF;">end</span>
</pre>
</div>

<p>
It is exactly as the others, except that the history is an element of type T. It could be used when we need to store only the last output (we
could use also the classic RepeatUntilConvergence{T} with memory<sub>size</sub>=1, but this is more efficient in this case).
We didn't implemented it, because we never use it.
</p>
</div>
</div>

<div id="outline-container-org9722c35" class="outline-4">
<h4 id="org9722c35"><span class="section-number-4">1.2.5.</span> Function update<sub>history</sub>!</h4>
<div class="outline-text-4" id="text-1-2-5">
<p>
Arguments (first method): an element of type either RepeatUntilConvergence{T} or LargeMemoryRepeatUntilConvergence{T}, and an element iter<sub>result</sub>
of type T (usually this is the result of an execution of the update function).
Output: the function pushes the iter<sub>result</sub> at the end of the history.
</p>

<p>
Arguments (second method): an element of type SingleValueRepeatUntilConvergence{T} and an element iter<sub>result</sub>
of type T (usually this is the result of an execution of the update function).
Output: it lets the history field to be iter<sub>result</sub>.
</p>
</div>
</div>
