docs/documentation.html

<div id="outline-container-org36c815c" class="outline-4">
<h4 id="org36c815c"><span class="section-number-4">1.2.6.</span> Function has<sub>converged</sub><sub>wrapper</sub></h4>
<div class="outline-text-4" id="text-1-2-6">
<p>
Arguments (first method): an element of type RepeatUntilConvergence{T}.
Output: it converts the CircularBuffer{T} into a Vector{T} and then it returns true or false according to the has<sub>converged</sub> function applied on
the converted history.
</p>

<p>
Arguments (second method): an element of type either LargeMemoryRepeatUntilConvergence{T} or SingleValueRepeatUntilConvergence{T}.
Output: it returns true or false according to the has<sub>converged</sub> function applied on
the converted history.
</p>
</div>
</div>

<div id="outline-container-orgce00407" class="outline-4">
<h4 id="orgce00407"><span class="section-number-4">1.2.7.</span> Function execute!</h4>
<div class="outline-text-4" id="text-1-2-7">
<p>
It just execute the process of a BaseRepeatUntilConvergence{T} element, given an initial value.
</p>
</div>
</div>
</div>


<div id="outline-container-orgfa0c19d" class="outline-3">
<h3 id="orgfa0c19d"><span class="section-number-3">1.3.</span> SinkhornKnopp.jl</h3>
<div class="outline-text-3" id="text-1-3">
<p>
The Sinkhorn-Knopp algorithm is an iterative algorithm which computes an (approximate) solution of the following minimum problem: 
\[\min \; C \cdot \T + \varpesilon KL(T),\]
where the minimum is taken over all the transport plans between two fixed marginal distributions p and q, \(\varepsilon\) is a fixed 
(small) constant and KL is the Kullback-Leibler divergence.
</p>
</div>

<div id="outline-container-orgaa80273" class="outline-4">
<h4 id="orgaa80273"><span class="section-number-4">1.3.1.</span> struct data<sub>SK</sub></h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
The struct "data<sub>SK</sub>" contains all the necessary to compute a single update of the Sinkhorn-Knopp algorithm.
</p>

<div class="org-src-container">
<pre class="src src-julia"><span style="color: #5EC4FF;">struct</span> <span style="color: #EBBF83;">data_SK</span>:
    K::<span style="color: #EBBF83;">Matrix</span><span style="color: #5EC4FF;">{</span>Float64<span style="color: #5EC4FF;">}</span> 
    p::<span style="color: #EBBF83;">Vector</span><span style="color: #5EC4FF;">{</span>Float64<span style="color: #5EC4FF;">}</span> 
    q::<span style="color: #EBBF83;">Vector</span><span style="color: #5EC4FF;">{</span>Float64<span style="color: #5EC4FF;">}</span> 
    T::<span style="color: #EBBF83;">Matrix</span><span style="color: #5EC4FF;">{</span>Float64<span style="color: #5EC4FF;">}</span>       
    a::<span style="color: #EBBF83;">Vector</span><span style="color: #5EC4FF;">{</span>Float64<span style="color: #5EC4FF;">}</span>       
    b::<span style="color: #EBBF83;">Vector</span><span style="color: #5EC4FF;">{</span>Float64<span style="color: #5EC4FF;">}</span>
    inner_constructor<span style="color: #5EC4FF;">(</span>K,p,q,T<span style="color: #5EC4FF;">)</span>   
<span style="color: #5EC4FF;">end</span>
</pre>
</div>
</div>

<ol class="org-ol">
<li><a id="orgc29db98"></a>K<br />
<div class="outline-text-5" id="text-1-3-1-1">
<p>
The matrix K is the element-wise exponentiation of C/epsilon, so it must be used only with this setting.
</p>
</div>
</li>


<li><a id="org741ba92"></a>p and q<br />
<div class="outline-text-5" id="text-1-3-1-2">
<p>
These two vectors are the marginal distributions, so they must be non-negative and with sum 1.
</p>
</div>
</li>

<li><a id="org7158952"></a>T<br />
<div class="outline-text-5" id="text-1-3-1-3">
<p>
T is a feasible transport plan between p and q.
</p>
</div>
</li>

<li><a id="orga3ff166"></a>a and b<br />
<div class="outline-text-5" id="text-1-3-1-4">
<p>
They are the vectors that are updated by the Sinkhorn algorithm.
</p>
</div>
</li>

<li><a id="orgf80e680"></a>inner<sub>constructor</sub><br />
<div class="outline-text-5" id="text-1-3-1-5">
<p>
It takes just K, p, q and T. It just checks that the dimensions of this object are correct, and then it built an element of type data<sub>SK</sub> with
K, p, q, T, a \= constant vector with sum 1 (it actually could be any initialization, we just decided for this one) and \(b \= \frac{q}{K^T*a}\)
</p>
</div>
</li>
</ol>
</div>

<div id="outline-container-orgfeec790" class="outline-4">
<h4 id="orgfeec790"><span class="section-number-4">1.3.2.</span> Function update<sub>SK</sub></h4>
<div class="outline-text-4" id="text-1-3-2">
<p>
Arguments: an element of type data<sub>SK</sub>. 
Output: it computes a single iteration of the Sinkhorn algorithm updating a, b and T in the following way: 
     \[a = \frac{p}{K*b}, \quad b = \frac{q}{K^T*a}, \quad T = diag(a)*K*diag(b)\]
</p>
</div>
</div>

<div id="outline-container-org7a8c3ec" class="outline-4">
<h4 id="org7a8c3ec"><span class="section-number-4">1.3.3.</span> Function compute<sub>marginals</sub></h4>
<div class="outline-text-4" id="text-1-3-3">
<p>
Arguments: a squared  matrix.
Output: two vector, which are obtained summing all the rows and all the columns (one must think the matrix as the element T of a data<sub>SK</sub> and 
the hope is that this two vectors are "similar" to p and q).
</p>
</div>
</div>

<div id="outline-container-org7035792" class="outline-4">
<h4 id="org7035792"><span class="section-number-4">1.3.4.</span> Function stop<sub>SK</sub><sub>T</sub></h4>
<div class="outline-text-4" id="text-1-3-4">
<p>
Arguments: a vector history, of size at least 2, of elements of type data<sub>SK</sub> and a float tol, which is the tolerance. 
Output: it returns true if the 1-norm between history[end].T and history[end-1].T is less than tol, otherwise it return false.
</p>
</div>
</div>

<div id="outline-container-org5ee4c49" class="outline-4">
<h4 id="org5ee4c49"><span class="section-number-4">1.3.5.</span> Function stop<sub>SK</sub><sub>ab</sub><sub>old</sub></h4>
<div class="outline-text-4" id="text-1-3-5">
<p>
Arguments: a vector history, of size at least 1, of elements of type data<sub>SK</sub> and a float tol, which is the tolerance. 
Output: it computes the marginals \(\mu\) and \(\nu\) of history[end].T and it returns true if both the 1-norm of history[end].p-\(\mu\) and 
history[end-1].q-\(\nu\) are less than tol, otherwise it return false.
</p>
</div>
</div>

<div id="outline-container-org67a75a3" class="outline-4">
<h4 id="org67a75a3"><span class="section-number-4">1.3.6.</span> Function stop<sub>SK</sub><sub>ab</sub><sub>new</sub></h4>
<div class="outline-text-4" id="text-1-3-6">
<p>
Arguments: a vector history, of size at least 1, of elements of type data<sub>SK</sub> and a float tol, which is the tolerance. 
Output: it does exactly the same of stop<sub>SK</sub><sub>ab</sub><sub>old</sub> without using directly the T filed of the struct, but recomputing it using a, b and K fields.
</p>
</div>
</div>

<div id="outline-container-org4d01084" class="outline-4">
<h4 id="org4d01084"><span class="section-number-4">1.3.7.</span> Function stop<sub>SK</sub></h4>
<div class="outline-text-4" id="text-1-3-7">
<p>
Arguments: a vector history, of size at least 1, of elements of type data<sub>SK</sub> and a float tol, which is the tolerance. 
Output: it returns true if both stop<sub>SK</sub><sub>T</sub> and stop<sub>SK</sub><sub>ab</sub><sub>new</sub> return true on the same arguments, otherwise it returns false (this is the
most precise stop criterion, since it checks both the difference betwwen the updating of the transport and how much the marginal distributions
are different from the ones we want).
</p>
</div>
</div>
</div>


<div id="outline-container-org6869cda" class="outline-3">
<h3 id="org6869cda"><span class="section-number-3">1.4.</span> loss.jl</h3>
<div class="outline-text-3" id="text-1-4">
<p>
In this file we built a simple struct "loss" to make more compact the syntax in the future algorithms concerning the chosen of the loss function.
</p>

<p>
The theory tells us that the Gromov-Wasserstein distance between two finite metric measure spaces \((C,\mu)\) and \((D,\nu)\) is given by 
\[GW((C,\mu),(D,\nu)) = \min_T \sum_{i,j,k,l} L(C_{ik},D_{jl})T_{ij}T_{kl},\]
where the infimum is taken over all the transport plans T between the marginals \(\mu\) and \(\nu\). In a more compact way, we will write the
expression above as \(\langle L\otimes T , T\rangle\), where the matrix \(L(C,D)\otimes T\) is defined as 
\[(L(C,D) \otimes T)_{kl} = L(L(C_{ik},D_{jl})T_{ij}).\]
</p>

<p>
So, to define the Gromov-Wasserstein distance, we need a function \(L:\mathbb{R} \to \mathbb{R}\), called loss function. The only admissible
functions for this work are the L2 loss and the KL loss, defined as 
\[L2(a,b) = (a-b)^2,\quad KL(a,b) = a\log(a/b) -a +b.\]
</p>

<p>
In general, for this algorithm, one can consider loss functions that can be written as \(L(a,b) = f_1(a) + f_2(b) - h_1(a)h_2(b)\) (note that 
L2 and KL can be written in this way). This form is important for the computation of the tensor product \(L(C,D)\otimes T\), that can be computed 
using the following formula
\[L(C,D) \otimes T = f_1(C) *\mu * ones(n)^T + ones(m) *\nu * f_2(D)^T -h_1(C) *T * h_2(D)^T,\]
where n is the size of \((C,\mu)\), m is the size of \((D,\nu)\), the exponentiation to T is the transpose and the functions f1, f2, h1, h2 
are applied element-wise.
</p>
</div>

<div id="outline-container-org5734442" class="outline-4">
<h4 id="org5734442"><span class="section-number-4">1.4.1.</span> struct loss</h4>
<div class="outline-text-4" id="text-1-4-1">
<p>
It contains all the informations we talked above regarding a loss function.
</p>

<div class="org-src-container">
<pre class="src src-julia"><span style="color: #5EC4FF;">struct</span> <span style="color: #EBBF83;">Loss</span>:
    string::<span style="color: #EBBF83;">String</span>
    f1::<span style="color: #EBBF83;">Function</span>
    f2::<span style="color: #EBBF83;">Function</span>
    h1::<span style="color: #EBBF83;">Function</span>
    h2::<span style="color: #EBBF83;">Function</span>  
<span style="color: #5EC4FF;">end</span>
</pre>
</div>
</div>

<ol class="org-ol">
