docs/documentation.html
<li><a id="org050eb6b"></a>string<br />
<div class="outline-text-5" id="text-1-4-1-1">
<p>
It contains the name of the loss function. The only admissible strings are "L2" and "KL", to distinguish when we use the Euclidean loss or the 
Kullback-Leibler one.
</p>
</div>
</li>

<li><a id="orgdf65f6a"></a>f1, f2, h1, h2<br />
<div class="outline-text-5" id="text-1-4-1-2">
<p>
They take a float and give another float. They are defined according to the structure above, depending if string=L2 or string=KL.
</p>
</div>
</li>

<li><a id="orgdaed67a"></a>inner constructor<br />
<div class="outline-text-5" id="text-1-4-1-3">
<p>
Argument: a string
Output: if the string is "L2" or "KL", it defines the function fields according to the decomposition above, otherwise it raises an error.
</p>
</div>
</li>
</ol>
</div>

<div id="outline-container-orgfccaf41" class="outline-4">
<h4 id="orgfccaf41"><span class="section-number-4">1.4.2.</span> Function GW<sub>cost</sub></h4>
<div class="outline-text-4" id="text-1-4-2">
<p>
Arguments: a Loss field, two metric measure spaces \(M=(C,\mu)\) and \(N=(D,\nu)\), a matrix of floats, a float \(\varepsilon\).
Output: it computes the tensor product \(E = L(C,D)\otimes T\) (it raises an error if the size are not compatible) and then it returns the
component-wise exponentiation of \(E/\varepsilon\), so that the output is ready to be given in input as field K of a data<sub>SK</sub>, so that it can be
used for the Sinkhorn algorithm.
</p>
</div>
</div>
</div>


<div id="outline-container-orgba29220" class="outline-3">
<h3 id="orgba29220"><span class="section-number-3">1.5.</span> Barycenters.jl</h3>
<div class="outline-text-3" id="text-1-5">
<p>
In this file, we use all the code developed before to implement the main algorithm "GW<sub>barycenters</sub>" that computes an approximatione of the 
Gromov Wasserstein barycenter. 
</p>
</div>

<div id="outline-container-org508b8da" class="outline-4">
<h4 id="org508b8da"><span class="section-number-4">1.5.1.</span> Function update<sub>transport</sub></h4>
<div class="outline-text-4" id="text-1-5-1">
<p>
Arguments:  - a matrix Ts of Float (it is the transport plan to be updated)
</p>
<ul class="org-ul">
<li>two MetricMeasureSpace data, between it has to compute the optimal transport plan</li>
<li>a loss function (using a struct loss)</li>
<li>a positive float epsilon</li>
<li>a posotive tolerance to stop the Sinkhorn algorithm.</li>
</ul>
<p>
Output: building a struct RepeatUntilConvergence, it runs the Sinkhorn algorithm between the weights of the metric measure spaces with cost K,
evaluated using the function GW<sub>cost</sub>, so it returns an approximation of the optimal transport plan between the two spaces.
</p>
</div>
</div>

<div id="outline-container-org935bc3b" class="outline-4">
<h4 id="org935bc3b"><span class="section-number-4">1.5.2.</span> Function stop<sub>tranport</sub></h4>
<div class="outline-text-4" id="text-1-5-2">
<p>
Arguments: a Vector of Matrix{Float64} and a Float64.
Output: it checks if the last two elements of the Vector are close enough (considering if the ratio between the difference of the matrices and the
last matrix is, w.r.t. the infinity norm, less than the error input). 
</p>
</div>
</div>

<div id="outline-container-orgd5ae4f7" class="outline-4">
<h4 id="orgd5ae4f7"><span class="section-number-4">1.5.3.</span> Function compute<sub>C</sub></h4>
<div class="outline-text-4" id="text-1-5-3">
<p>
Arguments:  - a ConvexSum type \(\lambda\)
</p>
<ul class="org-ul">
<li>a Vector of MetricMeasureSpace, that are the ones between, in the end, we want to compute the barycenters</li>
<li>a Vector of Float64, that will be the weight of a MetricMeasureSpace</li>
<li>a Vector of Matrix{Float64}, that is a collection of transport plans between p and the collection of MetricMeasurespaces</li>
<li>a loss function</li>
</ul>
<p>
Output: if the loss function is the Euclidean loss, it calculates 
    \[C = \frac{1}{p p^T} \sum_{s} \lambda_s T_s^T C_s T_s,\]
</p>

<p>
otherwise the loss function is the Kullback-Leibler function and it calculates
    \[C = exp (\frac{1}{p p^T} \sum_{s} \lambda_s T_s^T log(C_s) T_s).\]
</p>

<p>
Then the output is the MetricMeasureSpace given by the couple (C,p).
</p>
</div>
</div>

<div id="outline-container-org62320e4" class="outline-4">
<h4 id="org62320e4"><span class="section-number-4">1.5.4.</span> Function init<sub>Ts</sub></h4>
<div class="outline-text-4" id="text-1-5-4">
<p>
Arguments: two MetricMeasureSpace data.
Output: it returns the rank-one matrix obtained by multiplying the weights of the arguments, that is the trivial transport. 
</p>
</div>
</div>

<div id="outline-container-org22c1f36" class="outline-4">
<h4 id="org22c1f36"><span class="section-number-4">1.5.5.</span> Function update<sub>barycenters</sub></h4>
<div class="outline-text-4" id="text-1-5-5">
<p>
Arguments:  - a MetricMeasureSpace Cp
</p>
<ul class="org-ul">
<li>a Vector of MetricMeasureSpace, that are the ones between, in the end, we want to compute the barycenters</li>
<li>a ConvexSum type \(\lambda\)</li>
<li>a loss function</li>
<li>a Float \(\epsilon\)</li>
<li>a Float64 Ts<sub>tol</sub>, that is the error that we can obtain updating the transport plans</li>
<li>a Float64 SK<sub>tol</sub>, that is the error that we admit on the iteration of the Sinkhorn algoritm.</li>
</ul>
<p>
Output:  for any Cs in the Vector of MetricMeasureSpace, it updates the transport between Cp and Cs until the tolerance Ts<sub>tol</sub> is satisfied.
To do so we use a struct RepeatUntilConvergence, repeating the function update<sub>transport</sub> (keeping fixed all the data but the Ts) with stop 
criterion given by the function stop<sub>transport</sub>, and with initial data given by init<sub>Ts</sub>(Cp,Cs).
In the end the function returns the output of the function compute<sub>C</sub> using our data and the Vector
of transport plans that we obtained (so, in the end, it is updating the matrix of the MetricMeasureSpace Cp)
</p>
</div>
</div>

<div id="outline-container-orgdea3eb3" class="outline-4">
<h4 id="orgdea3eb3"><span class="section-number-4">1.5.6.</span> Function stop<sub>barycenters</sub><sub>niter</sub></h4>
<div class="outline-text-4" id="text-1-5-6">
<p>
Arguments: a Vector, called history, of MetricMeasureSpace data and an Int64.
Output: the algorithm returns true if the length of the history is greater than the Int64 data, otherwise it returns false.
</p>
</div>
</div>

<div id="outline-container-org61e823c" class="outline-4">
<h4 id="org61e823c"><span class="section-number-4">1.5.7.</span> Function init<sub>C</sub></h4>
<div class="outline-text-4" id="text-1-5-7">
<p>
Argument: a Vector p of Float64.
Output: it initializes the barycenter to be a random square matrix C (with zeros on the diagonal) of size length(p), and then it returns the 
MetricMeasureSpace given by the couple (C,p).
</p>
</div>
</div>

<div id="outline-container-orgcce97b8" class="outline-4">
<h4 id="orgcce97b8"><span class="section-number-4">1.5.8.</span> Function GW<sub>barycenters</sub> (the main function)</h4>
<div class="outline-text-4" id="text-1-5-8">
<p>
Arguments:  - a (collection) Vector Cs<sub>collection</sub> of MetricMeasureSpace data
</p>
<ul class="org-ul">
<li>a ConvexSum type \(\lambda\)</li>
<li>a Int64 n (the size of the barycenter as a MetricMeasureSpace)</li>
<li>a Vector p of Float64 (the weight of the barycenter)</li>
<li>a loss function</li>
<li>a Float \(\epsilon\)</li>
<li>a Int64 Cp<sub>niter</sub> (the number of iteration of the update<sub>barycenters</sub> function)</li>
<li>a Float64 Ts<sub>tol</sub>, that is the error that we can obtain updating the transport plans</li>
<li>a Float64 SK<sub>tol</sub>, that is the error that we admit on the iteration of the Sinkhorn algoritm.</li>
</ul>
<p>
Output: keeping fixed the parameters Cs<sub>collection</sub>, \(\lambda\), loss, \(\epsilon\), Ts<sub>tol</sub>, SK<sub>tol</sub>, it defines the function 
update<sub>barycenters</sub><sub>repeater</sub>, that takes as input a MetricMeasureSpace and returns aMetricMEasureSpace. So, using a struct RepeatUntilConvergence, 
starting from the MetricMeasureSpace init<sub>C</sub>(p), repeating the function update<sub>barycenters</sub><sub>repeater</sub>, with stop function stop<sub>barycenters</sub><sub>niter</sub>, 
the functions returns the last MetricMeasureSpace obtained by the iteration, that is the approximation of the barycenters that we were looking 
for.
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Davide Badalotti</p>
<p class="date">Created: 2023-01-30 Mon 18:53</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
